SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg29/ble_efr32xg29_configurator_out.c
const uint32_t ble_viterbi1M_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_0, /* Write: SEQ.PHYINFO */
  0x00014010UL, 0x00004101UL, /* Write: FRC.MAXLENGTH */
  0x0001403CUL, 0x00000000UL, /* Write: FRC.FECCTRL */
  0x00014048UL, 0x030007A0UL, /* Write: FRC.CTRL */
  0x00014050UL, 0x00000000UL, /* Write: FRC.TRAILTXDATACTRL */
  0x0001405CUL, 0x00000000UL, /* Write: FRC.CONVGENERATOR */
  0x00014104UL, 0x00004CFFUL, /* Write: FRC.FCD0 */
  0x01034020UL, 0x86000000UL, /* Write: MODEM.CTRL0 */
  /*    4024 */ 0x0001C01FUL, /* MODEM.CTRL1 */
  /*    4028 */ 0x00006000UL, /* MODEM.CTRL2 */
  0x01014038UL, 0x40000000UL, /* Write: MODEM.CTRL6 */
  0x01044058UL, 0x00FF04C8UL, /* Write: MODEM.TXBR */
  /*    405C */ 0x00000840UL, /* MODEM.RXBR */
  /*    4060 */ 0x00000001UL, /* MODEM.CF */
  /*    4064 */ 0x00040092UL, /* MODEM.PRE */
  0x010F4080UL, 0x020C008CUL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x002203B6UL, /* MODEM.MODINDEX */
  /*    408C */ 0x00000000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x0E050200UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x53432F1CUL, /* MODEM.SHAPING1 */
  /*    409C */ 0x61686962UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x04324355UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x0E0E1016UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x080A0C0DUL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x04050607UL, /* MODEM.SHAPING6 */
  /*    40B0 */ 0x02020303UL, /* MODEM.SHAPING7 */
  /*    40B4 */ 0x01010102UL, /* MODEM.SHAPING8 */
  /*    40B8 */ 0x00010101UL, /* MODEM.SHAPING9 */
  0x010140ECUL, 0x8C2BE890UL, /* Write: MODEM.SRCCHF */
  0x010340FCUL, 0x000A2090UL, /* Write: MODEM.DSACTRL */
  /*    4100 */ 0x80585B05UL, /* MODEM.VITERBIDEMOD */
  /*    4104 */ 0x4A413747UL, /* MODEM.VTCORRCFG0 */
  0x0103410CUL, 0x005262F5UL, /* Write: MODEM.DIGMIXCTRL */
  /*    4110 */ 0x2949192AUL, /* MODEM.VTCORRCFG1 */
  /*    4114 */ 0x40403B89UL, /* MODEM.VTTRACK */
  0x01014128UL, 0x0000DDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x01074138UL, 0x00FA53E8UL, /* Write: MODEM.LONGRANGE */
  /*    413C */ 0x00000000UL, /* MODEM.LONGRANGE1 */
  /*    4140 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  0x01014170UL, 0x000003C1UL, /* Write: MODEM.VTBLETIMING */
  0x01014234UL, 0x0E000000UL, /* Write: MODEM.BLEIQDSAEXT1 */
  0x01014248UL, 0xC01EAA58UL, /* Write: MODEM.REALTIMCFE */
  0x01034278UL, 0x00000000UL, /* Write: MODEM.COCURRMODE */
  /*    427C */ 0x00000000UL, /* MODEM.ANTDIVCTRL */
  /*    4280 */ 0x00000002UL, /* MODEM.BLEIQDSAEXT2 */
  0x01018038UL, 0x00102555UL, /* Write: SYNTH.IFFREQ */
  0x0103809CUL, 0x00000000UL, /* Write: SYNTH.LPFCTRL1CAL */
  /*    80A0 */ 0x00037870UL, /* SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x000000D0UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01CB4201UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x00FD3E01UL, /* OR: SYNTH.LPFCTRL2TX */
  0x020100E4UL, 0x13512F2EUL, /* Write: RAC.IFADCTRIM0 */
  0x02010154UL, 0x00023FC4UL, /* Write: RAC.SYTRIM1 */
  0xFFFFFFFFUL,
};

const uint32_t ble_viterbi2M_0_34_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_1, /* Write: SEQ.PHYINFO */
  0x00014010UL, 0x00004101UL, /* Write: FRC.MAXLENGTH */
  0x0001403CUL, 0x00000000UL, /* Write: FRC.FECCTRL */
  0x00014048UL, 0x030007A0UL, /* Write: FRC.CTRL */
  0x00014050UL, 0x00000000UL, /* Write: FRC.TRAILTXDATACTRL */
  0x0001405CUL, 0x00000000UL, /* Write: FRC.CONVGENERATOR */
  0x00014104UL, 0x00004CFFUL, /* Write: FRC.FCD0 */
  0x01034020UL, 0x86000000UL, /* Write: MODEM.CTRL0 */
  /*    4024 */ 0x0001C01FUL, /* MODEM.CTRL1 */
  /*    4028 */ 0x00006000UL, /* MODEM.CTRL2 */
  0x01014038UL, 0x40000000UL, /* Write: MODEM.CTRL6 */
  0x01044058UL, 0x00FF0264UL, /* Write: MODEM.TXBR */
  /*    405C */ 0x00000840UL, /* MODEM.RXBR */
  /*    4060 */ 0x00000001UL, /* MODEM.CF */
  /*    4064 */ 0x00080092UL, /* MODEM.PRE */
  0x010F4080UL, 0x020C008CUL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x002203D7UL, /* MODEM.MODINDEX */
  /*    408C */ 0x00000000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x0D050200UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x503F2D1AUL, /* MODEM.SHAPING1 */
  /*    409C */ 0x63696860UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x25354657UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x08090D15UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x05050607UL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x03040404UL, /* MODEM.SHAPING6 */
  /*    40B0 */ 0x02030303UL, /* MODEM.SHAPING7 */
  /*    40B4 */ 0x02020202UL, /* MODEM.SHAPING8 */
  /*    40B8 */ 0x01010101UL, /* MODEM.SHAPING9 */
  0x010140ECUL, 0x8C2C3890UL, /* Write: MODEM.SRCCHF */
  0x010340FCUL, 0x000A209CUL, /* Write: MODEM.DSACTRL */
  /*    4100 */ 0x80585B05UL, /* MODEM.VITERBIDEMOD */
  /*    4104 */ 0x4A413747UL, /* MODEM.VTCORRCFG0 */
  0x0103410CUL, 0x005255B8UL, /* Write: MODEM.DIGMIXCTRL */
  /*    4110 */ 0x2949192AUL, /* MODEM.VTCORRCFG1 */
  /*    4114 */ 0x40403B89UL, /* MODEM.VTTRACK */
  0x01014128UL, 0x0000DDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x01074138UL, 0x00FA53E8UL, /* Write: MODEM.LONGRANGE */
  /*    413C */ 0x00000000UL, /* MODEM.LONGRANGE1 */
  /*    4140 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  0x01014170UL, 0x000003C1UL, /* Write: MODEM.VTBLETIMING */
  0x01014234UL, 0x0E000000UL, /* Write: MODEM.BLEIQDSAEXT1 */
  0x01014248UL, 0xC01EAA58UL, /* Write: MODEM.REALTIMCFE */
  0x01034278UL, 0x00000000UL, /* Write: MODEM.COCURRMODE */
  /*    427C */ 0x00000000UL, /* MODEM.ANTDIVCTRL */
  /*    4280 */ 0x00000002UL, /* MODEM.BLEIQDSAEXT2 */
  0x01018038UL, 0x00104911UL, /* Write: SYNTH.IFFREQ */
  0x0103809CUL, 0x00000000UL, /* Write: SYNTH.LPFCTRL1CAL */
  /*    80A0 */ 0x00037870UL, /* SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x0002C0FFUL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01CB4201UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x000D0A01UL, /* OR: SYNTH.LPFCTRL2TX */
  0x020100E4UL, 0x11512F2CUL, /* Write: RAC.IFADCTRIM0 */
  0x02010154UL, 0x00003FC4UL, /* Write: RAC.SYTRIM1 */
  0xFFFFFFFFUL,
};

const uint32_t ble_LR_DSA_125kb_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_2, /* Write: SEQ.PHYINFO */
  0x00014010UL, 0x00004100UL, /* Write: FRC.MAXLENGTH */
  0x0001403CUL, 0x00000010UL, /* Write: FRC.FECCTRL */
  0x00014048UL, 0x03000720UL, /* Write: FRC.CTRL */
  0x00014050UL, 0x00000400UL, /* Write: FRC.TRAILTXDATACTRL */
  0x0001405CUL, 0x00000F0DUL, /* Write: FRC.CONVGENERATOR */
  0x00014104UL, 0x0001C003UL, /* Write: FRC.FCD0 */
  0x01034020UL, 0x46000030UL, /* Write: MODEM.CTRL0 */
  /*    4024 */ 0x0001C81FUL, /* MODEM.CTRL1 */
  /*    4028 */ 0x10002000UL, /* MODEM.CTRL2 */
  0x01014038UL, 0x00000000UL, /* Write: MODEM.CTRL6 */
  0x01044058UL, 0x00050018UL, /* Write: MODEM.TXBR */
  /*    405C */ 0x00000840UL, /* MODEM.RXBR */
  /*    4060 */ 0x00000009UL, /* MODEM.CF */
  /*    4064 */ 0x000A0092UL, /* MODEM.PRE */
  0x010F4080UL, 0x022C008CUL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x00120012UL, /* MODEM.MODINDEX */
  /*    408C */ 0x1B8C805BUL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x0E050200UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x53432F1CUL, /* MODEM.SHAPING1 */
  /*    409C */ 0x61686962UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x04324355UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x0E0E1016UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x080A0C0DUL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x04050607UL, /* MODEM.SHAPING6 */
  /*    40B0 */ 0x02020303UL, /* MODEM.SHAPING7 */
  /*    40B4 */ 0x01010102UL, /* MODEM.SHAPING8 */
  /*    40B8 */ 0x00010101UL, /* MODEM.SHAPING9 */
  0x010140ECUL, 0x8CB1B080UL, /* Write: MODEM.SRCCHF */
  0x010340FCUL, 0x000A209CUL, /* Write: MODEM.DSACTRL */
  /*    4100 */ 0x80206101UL, /* MODEM.VITERBIDEMOD */
  /*    4104 */ 0x123556B7UL, /* MODEM.VTCORRCFG0 */
  0x0103410CUL, 0x001255B8UL, /* Write: MODEM.DIGMIXCTRL */
  /*    4110 */ 0x29041BA0UL, /* MODEM.VTCORRCFG1 */
  /*    4114 */ 0x40408808UL, /* MODEM.VTTRACK */
  0x01014128UL, 0x00000000UL, /* Write: MODEM.CGCLKSTOP */
  0x01074138UL, 0x3BE8D44CUL, /* Write: MODEM.LONGRANGE */
  /*    413C */ 0x306F1904UL, /* MODEM.LONGRANGE1 */
  /*    4140 */ 0x1A140E08UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x322C2620UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x32103E38UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x0A987654UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x00005F1DUL, /* MODEM.LONGRANGE6 */
  0x01014170UL, 0x00000000UL, /* Write: MODEM.VTBLETIMING */
  0x01014234UL, 0x0E000800UL, /* Write: MODEM.BLEIQDSAEXT1 */
  0x01014248UL, 0x001F81F4UL, /* Write: MODEM.REALTIMCFE */
  0x01034278UL, 0x00000000UL, /* Write: MODEM.COCURRMODE */
  /*    427C */ 0x00000000UL, /* MODEM.ANTDIVCTRL */
  /*    4280 */ 0x00000012UL, /* MODEM.BLEIQDSAEXT2 */
  0x01018038UL, 0x00104911UL, /* Write: SYNTH.IFFREQ */
  0x0103809CUL, 0x000240EBUL, /* Write: SYNTH.LPFCTRL1CAL */
  /*    80A0 */ 0x00033870UL, /* SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x000000D0UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01FD5A01UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x00FD3E01UL, /* OR: SYNTH.LPFCTRL2TX */
  0x020100E4UL, 0x11512F2CUL, /* Write: RAC.IFADCTRIM0 */
  0x02010154UL, 0x00003FC4UL, /* Write: RAC.SYTRIM1 */
  0xFFFFFFFFUL,
};

const uint32_t ble_LR_DSA_500kb_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_3, /* Write: SEQ.PHYINFO */
  0x00014010UL, 0x00004100UL, /* Write: FRC.MAXLENGTH */
  0x0001403CUL, 0x00000010UL, /* Write: FRC.FECCTRL */
  0x00014048UL, 0x03001720UL, /* Write: FRC.CTRL */
  0x00014050UL, 0x00000401UL, /* Write: FRC.TRAILTXDATACTRL */
  0x0001405CUL, 0x00000F0DUL, /* Write: FRC.CONVGENERATOR */
  0x00014104UL, 0x0001C003UL, /* Write: FRC.FCD0 */
  0x01034020UL, 0x46000030UL, /* Write: MODEM.CTRL0 */
  /*    4024 */ 0x0001C81FUL, /* MODEM.CTRL1 */
  /*    4028 */ 0x10002000UL, /* MODEM.CTRL2 */
  0x01014038UL, 0x00000000UL, /* Write: MODEM.CTRL6 */
  0x01044058UL, 0x00050018UL, /* Write: MODEM.TXBR */
  /*    405C */ 0x00000840UL, /* MODEM.RXBR */
  /*    4060 */ 0x00000009UL, /* MODEM.CF */
  /*    4064 */ 0x000A0092UL, /* MODEM.PRE */
  0x010F4080UL, 0x022C008CUL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x00120012UL, /* MODEM.MODINDEX */
  /*    408C */ 0x1B8C805BUL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x0E050200UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x53432F1CUL, /* MODEM.SHAPING1 */
  /*    409C */ 0x61686962UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x04324355UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x0E0E1016UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x080A0C0DUL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x04050607UL, /* MODEM.SHAPING6 */
  /*    40B0 */ 0x02020303UL, /* MODEM.SHAPING7 */
  /*    40B4 */ 0x01010102UL, /* MODEM.SHAPING8 */
  /*    40B8 */ 0x00010101UL, /* MODEM.SHAPING9 */
  0x010140ECUL, 0x8CB1B080UL, /* Write: MODEM.SRCCHF */
  0x010340FCUL, 0x000A209CUL, /* Write: MODEM.DSACTRL */
  /*    4100 */ 0x80206101UL, /* MODEM.VITERBIDEMOD */
  /*    4104 */ 0x123556B7UL, /* MODEM.VTCORRCFG0 */
  0x0103410CUL, 0x001255B8UL, /* Write: MODEM.DIGMIXCTRL */
  /*    4110 */ 0x29041BA0UL, /* MODEM.VTCORRCFG1 */
  /*    4114 */ 0x40408808UL, /* MODEM.VTTRACK */
  0x01014128UL, 0x00000000UL, /* Write: MODEM.CGCLKSTOP */
  0x01074138UL, 0x3BE8D44CUL, /* Write: MODEM.LONGRANGE */
  /*    413C */ 0x306F1904UL, /* MODEM.LONGRANGE1 */
  /*    4140 */ 0x1C16100AUL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x342E2822UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x3210403AUL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x0A987654UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0xA4805F1DUL, /* MODEM.LONGRANGE6 */
  0x01014170UL, 0x00000000UL, /* Write: MODEM.VTBLETIMING */
  0x01014234UL, 0x0E000800UL, /* Write: MODEM.BLEIQDSAEXT1 */
  0x01014248UL, 0x001F81F4UL, /* Write: MODEM.REALTIMCFE */
  0x01034278UL, 0x00000000UL, /* Write: MODEM.COCURRMODE */
  /*    427C */ 0x00000000UL, /* MODEM.ANTDIVCTRL */
  /*    4280 */ 0x00000012UL, /* MODEM.BLEIQDSAEXT2 */
  0x01018038UL, 0x00104911UL, /* Write: SYNTH.IFFREQ */
  0x0103809CUL, 0x000240EBUL, /* Write: SYNTH.LPFCTRL1CAL */
  /*    80A0 */ 0x00033870UL, /* SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x000000D0UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01FD5A01UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x00FD3E01UL, /* OR: SYNTH.LPFCTRL2TX */
  0x020100E4UL, 0x11512F2CUL, /* Write: RAC.IFADCTRIM0 */
  0x02010154UL, 0x00003FC4UL, /* Write: RAC.SYTRIM1 */
  0xFFFFFFFFUL,
};

const uint32_t ble_LR_DSA_1Mb_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_4, /* Write: SEQ.PHYINFO */
  0x00014010UL, 0x00004100UL, /* Write: FRC.MAXLENGTH */
  0x0001403CUL, 0x00000000UL, /* Write: FRC.FECCTRL */
  0x00014048UL, 0x03000720UL, /* Write: FRC.CTRL */
  0x00014050UL, 0x00000000UL, /* Write: FRC.TRAILTXDATACTRL */
  0x0001405CUL, 0x00000F0DUL, /* Write: FRC.CONVGENERATOR */
  0x00014104UL, 0x00004CFFUL, /* Write: FRC.FCD0 */
  0x01034020UL, 0x86000000UL, /* Write: MODEM.CTRL0 */
  /*    4024 */ 0x0001C01FUL, /* MODEM.CTRL1 */
  /*    4028 */ 0x00002000UL, /* MODEM.CTRL2 */
  0x01014038UL, 0x00000000UL, /* Write: MODEM.CTRL6 */
  0x01044058UL, 0x00050018UL, /* Write: MODEM.TXBR */
  /*    405C */ 0x00000840UL, /* MODEM.RXBR */
  /*    4060 */ 0x00000009UL, /* MODEM.CF */
  /*    4064 */ 0x00040092UL, /* MODEM.PRE */
  0x010F4080UL, 0x022C008CUL, /* Write: MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x00120012UL, /* MODEM.MODINDEX */
  /*    408C */ 0x198C8000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x0E050200UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x53432F1CUL, /* MODEM.SHAPING1 */
  /*    409C */ 0x61686962UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x04324355UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x0E0E1016UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x080A0C0DUL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x04050607UL, /* MODEM.SHAPING6 */
  /*    40B0 */ 0x02020303UL, /* MODEM.SHAPING7 */
  /*    40B4 */ 0x01010102UL, /* MODEM.SHAPING8 */
  /*    40B8 */ 0x00010101UL, /* MODEM.SHAPING9 */
  0x010140ECUL, 0x8CB1B080UL, /* Write: MODEM.SRCCHF */
  0x010340FCUL, 0x000B209CUL, /* Write: MODEM.DSACTRL */
  /*    4100 */ 0x80605B05UL, /* MODEM.VITERBIDEMOD */
  /*    4104 */ 0x4A413747UL, /* MODEM.VTCORRCFG0 */
  0x0103410CUL, 0x001255B8UL, /* Write: MODEM.DIGMIXCTRL */
  /*    4110 */ 0x2949192AUL, /* MODEM.VTCORRCFG1 */
  /*    4114 */ 0x40400809UL, /* MODEM.VTTRACK */
  0x01014128UL, 0x0000DDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x01074138UL, 0x3BE8D44CUL, /* Write: MODEM.LONGRANGE */
  /*    413C */ 0x106F1904UL, /* MODEM.LONGRANGE1 */
  /*    4140 */ 0x1A140E08UL, /* MODEM.LONGRANGE2 */
  /*    4144 */ 0x322C2620UL, /* MODEM.LONGRANGE3 */
  /*    4148 */ 0x32103E38UL, /* MODEM.LONGRANGE4 */
  /*    414C */ 0x0A987654UL, /* MODEM.LONGRANGE5 */
  /*    4150 */ 0x0000001DUL, /* MODEM.LONGRANGE6 */
  0x01014170UL, 0x000003C0UL, /* Write: MODEM.VTBLETIMING */
  0x01014234UL, 0x0E000800UL, /* Write: MODEM.BLEIQDSAEXT1 */
  0x01014248UL, 0xC01EAA58UL, /* Write: MODEM.REALTIMCFE */
  0x01034278UL, 0x80000000UL, /* Write: MODEM.COCURRMODE */
  /*    427C */ 0x00000000UL, /* MODEM.ANTDIVCTRL */
  /*    4280 */ 0x00000012UL, /* MODEM.BLEIQDSAEXT2 */
  0x01018038UL, 0x00104911UL, /* Write: SYNTH.IFFREQ */
  0x0103809CUL, 0x000240EBUL, /* Write: SYNTH.LPFCTRL1CAL */
  /*    80A0 */ 0x00033870UL, /* SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x000000D0UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01FD5A01UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x00FD3E01UL, /* OR: SYNTH.LPFCTRL2TX */
  0x020100E4UL, 0x11512F2CUL, /* Write: RAC.IFADCTRIM0 */
  0x02010154UL, 0x00003FC4UL, /* Write: RAC.SYTRIM1 */
  0xFFFFFFFFUL,
};

const uint32_t quuppa_viterbi1M_0_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_5, /* Write: SEQ.PHYINFO */
  0x00014038UL, 0x00000056UL, /* Write: FRC.WHITEINIT */
  0x010140ECUL, 0x8C2B7890UL, /* Write: MODEM.SRCCHF */
  0x0101410CUL, 0x00526336UL, /* Write: MODEM.DIGMIXCTRL */
  0xFFFFFFFFUL,
};

const uint32_t quuppa_viterbi1M_1_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_5, /* Write: SEQ.PHYINFO */
  0x00014038UL, 0x00000065UL, /* Write: FRC.WHITEINIT */
  0x010140ECUL, 0x8C2B7890UL, /* Write: MODEM.SRCCHF */
  0x0101410CUL, 0x00526336UL, /* Write: MODEM.DIGMIXCTRL */
  0xFFFFFFFFUL,
};

const uint32_t quuppa_viterbi1M_2_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_5, /* Write: SEQ.PHYINFO */
  0x00014038UL, 0x00000058UL, /* Write: FRC.WHITEINIT */
  0x010140ECUL, 0x8C2B7890UL, /* Write: MODEM.SRCCHF */
  0x0101410CUL, 0x00526336UL, /* Write: MODEM.DIGMIXCTRL */
  0xFFFFFFFFUL,
};

const uint32_t quuppa_viterbi1M_3_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_5, /* Write: SEQ.PHYINFO */
  0x00014038UL, 0x00000066UL, /* Write: FRC.WHITEINIT */
  0x010140ECUL, 0x8C30C894UL, /* Write: MODEM.SRCCHF */
  0x0101410CUL, 0x00524FBFUL, /* Write: MODEM.DIGMIXCTRL */
  0xFFFFFFFFUL,
};

const RAIL_ChannelConfigEntry_t ble_viterbi1M_channels[] = {
  {
    .phyConfigDeltaAdd = ble_viterbi1M_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 39,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ble_viterbi2M_channels[] = {
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 34,
    .maxPower = 300,
    .attr = &channelConfigEntryAttr,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 35,
    .channelNumberEnd = 35,
    .maxPower = 182,
    .attr = &channelConfigEntryAttr,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 36,
    .channelNumberEnd = 36,
    .maxPower = 157,
    .attr = &channelConfigEntryAttr,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 37,
    .channelNumberEnd = 37,
    .maxPower = 125,
    .attr = &channelConfigEntryAttr,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 38,
    .channelNumberEnd = 38,
    .maxPower = 58,
    .attr = &channelConfigEntryAttr,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 39,
    .channelNumberEnd = 39,
    .maxPower = 300,
    .attr = &channelConfigEntryAttr,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ble_LR_DSA_125kb_channels[] = {
  {
    .phyConfigDeltaAdd = ble_LR_DSA_125kb_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 39,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_2,
#endif
    .alternatePhy = NULL,
  },
};

